# FieldId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFilter..::..FieldId Property
ScheduleFilter Class See Also
---
The ID of the field used to filter the schedule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ScheduleFieldId FieldId { get; set; }
```

Visual Basic
---
```text
Public Property FieldId As ScheduleFieldId
	Get
	Set
```

Visual C++
---
```text
public:
property ScheduleFieldId^ FieldId {
	ScheduleFieldId^ get ();
	void set (ScheduleFieldId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ScheduleFilter Class
Autodesk.Revit.DB Namespace